БИТУправление_медицинским_центром_демо/src/Documents/МедицинскийОтчет/МедицинскийОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МедицинскийОтчет</name>
  <comment>Медицинский отчет</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Вид</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчетности</name>
    <comment>Вид отчетности</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыбраннаяФорма</name>
    <comment>Выбранная форма</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОтчета</name>
    <comment>Сохраненные данные отчета</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <comment>Дата подписи</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоНастройкиСтраниц</name>
    <comment>Дерево со списком настроек страниц</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОтчета</name>
    <comment>Имя встроенной или имя файла внешней обработки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОтчета</name>
    <comment>Наименование медицинского отчета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <comment>Периодичность представления отчета</comment>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненныеДанныеПодписанногоДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <comment>Документ подписан ЭЦП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/МедицинскийОтчет/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьИменаКлючевыхРеквизитов() Экспорт
	
	// !ДанныеОбъекта - служебное имя реквизита, означающее, что процедура формирования строки значений полей полностью переопределена.		
	// !ХешФайлов - служебное имя реквизита, формирует строку хеша файлов по объекту
	
	МассивИмен = Новый Массив;
	
	МассивИмен.Добавить("!ДанныеОбъекта");
	
	Возврат МассивИмен;

КонецФункции

Функция ПодписываетсяЭП(ИсточникОтчета) Экспорт
	
	Попытка
		Возврат МедицинскаяОтчетность.МедОтчеты(ИсточникОтчета).ПодписываетсяЭП();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция РолиДляПодписания(ИсточникОтчета) Экспорт
	
	Попытка
		Возврат МедицинскаяОтчетность.МедОтчеты(ИсточникОтчета).РолиДляПодписания();
	Исключение
		Возврат Новый Массив;
	КонецПопытки;
	
КонецФункции

Функция РольДоступнаТекущемуПользователю(МедицинскийОтчет, Роль) Экспорт
	
	Попытка
		Возврат МедицинскаяОтчетность.МедОтчеты(МедицинскийОтчет.ИсточникОтчета).РольДоступнаТекущемуПользователю(МедицинскийОтчет, Роль);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьТабличныеДокументыОтчета(МедицинскийОтчет) Экспорт
	
	мТабДоки = Новый Массив;
	
	ИмяОтчета = МедицинскийОтчет.ИсточникОтчета;
	ДеревоСтраниц = МедицинскийОтчет.ДеревоНастройкиСтраниц.Получить();
	
	ДобавитьТабДокиПоСтрокам(ИмяОтчета, МедицинскийОтчет.ВыбраннаяФорма, МедицинскийОтчет.ДанныеОтчета.Получить().ПоказателиОтчета, ДеревоСтраниц.Строки, мТабДоки, "");
	
	Возврат мТабДоки;
	
КонецФункции

Процедура ДобавитьТабДокиПоСтрокам(ИмяОтчета, ВыбраннаяФорма, ПоказателиОтчета, КоллекцияСтрок, мТабДоки, Знач Префикс)
	
	Для Каждого СтрокаСтраницы Из КоллекцияСтрок Цикл
		ПрефиксСНомером = СтрШаблон("%1%2.", Префикс, КоллекцияСтрок.Индекс(СтрокаСтраницы) + 1);
		ТабДок = СформироватьТабличныйДокументПоРазделу(СтрокаСтраницы.ИмяСтраницы, Неопределено, ИмяОтчета, ВыбраннаяФорма, ПоказателиОтчета);
		мТабДоки.Добавить(Новый Структура("ТабДок, ИмяФайла", ТабДок, СтрШаблон("%1 %2", ПрефиксСНомером, СтрокаСтраницы.Представление)));
		ДобавитьТабДокиПоСтрокам(ИмяОтчета, ВыбраннаяФорма, ПоказателиОтчета, СтрокаСтраницы.Строки, мТабДоки, ПрефиксСНомером);
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьТабличныйДокументПоРазделу(ИмяТекРаздела, ОтчетОбъект, ИмяОтчета, НаименованиеФормыОтчета, СтруктураДанныхСтраниц) Экспорт
	
	Если ОтчетОбъект = Неопределено Тогда
		ОтчетОбъект = МедицинскаяОтчетностьВызовСервера.ОтчетФабрикаМакетов(ИмяОтчета);
	КонецЕсли;
	
	МакетСтраницы = ОтчетОбъект.ПолучитьМакет(НаименованиеФормыОтчета + "_" + ИмяТекРаздела);
	
	РаботаСМногострочнымиОбластями(МакетСтраницы, ИмяТекРаздела, СтруктураДанныхСтраниц);
	
	ТабДокРаздела = Новый ТабличныйДокумент;
	ТабДокРаздела.Очистить();
	ТабДокРаздела.Вывести(МакетСтраницы);
	
	Для Каждого ЭлСтруктуры Из СтруктураДанныхСтраниц[ИмяТекРаздела] Цикл
		Попытка
			ТабДокРаздела.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
		Исключение КонецПопытки;
	КонецЦикла;
	
	Возврат ТабДокРаздела;
	
КонецФункции

Процедура РаботаСМногострочнымиОбластями(МакетСтраницы, ИмяТекРаздела, СтруктураДанныхСтраниц) Экспорт
	
	// Ищем в макете динамически изменяющиеся таблицы
	МногоСтрочныеОбласти = Новый Структура;
	Для Каждого Эл Из МакетСтраницы.Области Цикл
		ПозицияРазделителяДинамТаблицы = СтрНайти(Эл.Имя, "__");
		Если ПозицияРазделителяДинамТаблицы <> 0 Тогда
			ИмяОбластиТаблицы = Лев(Эл.Имя, ПозицияРазделителяДинамТаблицы - 1);
			Если Не МногоСтрочныеОбласти.Свойство(ИмяОбластиТаблицы) 
				И СтрНайти(НРег(Эл.Имя), "x", , ПозицияРазделителяДинамТаблицы + 2) <> 0
			Тогда
				МногоСтрочныеОбласти.Вставить(ИмяОбластиТаблицы, 0);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МногоСтрочныеОбласти.Количество() <> 0 Тогда
		Для Каждого Эл Из СтруктураДанныхСтраниц[ИмяТекРаздела] Цикл
			ПозицияРазделителяДинамТаблицы = СтрНайти(Эл.Ключ, "__");
			Если ПозицияРазделителяДинамТаблицы <> 0 Тогда
				ИмяОбластиТаблицы = Лев(Эл.Ключ, ПозицияРазделителяДинамТаблицы - 1);
				Если МногоСтрочныеОбласти.Свойство(ИмяОбластиТаблицы) Тогда
					ПозицияРазделителяСтроки = СтрНайти(Эл.Ключ, "_", ,ПозицияРазделителяДинамТаблицы + 2);
					Если ПозицияРазделителяСтроки <> 0 Тогда
						ЧислоСтрокиСтрокой = Прав(Эл.Ключ, СтрДлина(Эл.Ключ) - ПозицияРазделителяСтроки);
						Попытка
							ЧислоСтроки = Число(ЧислоСтрокиСтрокой);
							Если МногоСтрочныеОбласти[ИмяОбластиТаблицы] < ЧислоСтроки Тогда
								МногоСтрочныеОбласти.Вставить(ИмяОбластиТаблицы, ЧислоСтроки);
							КонецЕсли;
						Исключение КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Добавляем динамически строки
	Для Каждого Эл Из МногоСтрочныеОбласти Цикл
		КоличествоСтрок = Эл.Значение;
		Для Счетчик = 1 По КоличествоСтрок Цикл
			ТекущаяОбластьТабДок = МакетСтраницы.ПолучитьОбласть(Эл.Ключ);
			Для Каждого Область Из ТекущаяОбластьТабДок.Области Цикл
				Если Область.Имя <> Эл.Ключ Тогда
					НовоеИмя = СтрЗаменить(Область.Имя, "x", Строка(Счетчик));
					НовоеИмя = СтрЗаменить(НовоеИмя, "X", Строка(Счетчик));
					Область.Имя = НовоеИмя;
				Иначе
					Область.Имя = Область.Имя + Строка(Счетчик);
				КонецЕсли;
			КонецЦикла;
			СтараяОбласть = МакетСтраницы.Область(Эл.Ключ);
			НоваяОбласть = ТекущаяОбластьТабДок.Область("R1C1:" + "R" + ТекущаяОбластьТабДок.ВысотаТаблицы + "C" +ТекущаяОбластьТабДок.ШиринаТаблицы);
			МакетСтраницы.ВставитьОбласть(НоваяОбласть, СтараяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЦикла;
		
		МакетСтраницы.УдалитьОбласть(МакетСтраницы.Область(Эл.Ключ), ТипСмещенияТабличногоДокумента.ПоВертикали);
		Если КоличествоСтрок = 0 Тогда
			Попытка
				ИмяОбластиШапки = "Шапка" + Эл.Ключ;
				МакетСтраницы.УдалитьОбласть(МакетСтраницы.Область(ИмяОбластиШапки), ТипСмещенияТабличногоДокумента.ПоВертикали);
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
